Тест1/src/Documents/Дозвон/Дозвон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Дозвон</name>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДозвона</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийАудитора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПерезвона</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скрипт</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/Enums/СтатусыДозвона/СтатусыДозвона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДозвона</name>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Перезвон</name>
  </enumValues>
</mdclass:Enum>

Тест1/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.Roistat_Сделки</registerRecords>
  <attributes>
    <name>КлиентНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.дт_СостоянияЗаказовКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСвязи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролёр</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКонтроля</name>
    <type>
      <types>EnumRef.СтатусыКонтроляЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОписания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Канал</name>
    <type>
      <types>CatalogRef.ИсточникиОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <type>
      <types>EnumRef.ТипЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПредлагаемойЦены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоВзаимодействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прослушано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АтоматическоеСоздание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПродажи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Целевая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодстатусОбработки</name>
    <type>
      <types>EnumRef.ПодстатусыОбработкиЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработку</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>WTPanel</name>
    <type>
      <types>CatalogRef.СтатусыWT</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланРеагированияНаЗаявку</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОригинала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредлагаемаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.дт_РолиВПродаже</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/Documents/Дозвон/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура СортировкаПриИзмененииНаСервере()
	
	///+ГомзМА 31.01.2023 (Задача 000002631 от 31.01.2023)
	Текст = "ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Продажи.Ссылка) КАК РегистраторСсылка,
	        |	Продажи.Клиент КАК РегистраторКлиент
	        |ПОМЕСТИТЬ ВТ_КолвоПродаж
	        |ИЗ
	        |	Документ.ПродажаЗапчастей КАК Продажи
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Продажи.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Продажи.Клиент КАК РегистраторКлиент,
	        |	СУММА(Продажи.ИтогоРекв) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_СуммаПродаж
	        |ИЗ
	        |	Документ.ПродажаЗапчастей КАК Продажи
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Продажи.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК Ссылка,
	        |	ЗаказКлиента.Клиент КАК Клиент
	        |ПОМЕСТИТЬ ВТ_Заявки
	        |ИЗ
	        |	Документ.ЗаказКлиента КАК ЗаказКлиента
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗаказКлиента.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗаказКлиента.Клиент КАК Клиент,
	        |	СУММА(ЗаказКлиента.СуммаДокумента) КАК СуммаДокумента
	        |ПОМЕСТИТЬ ВТ_СуммаЗаявок
	        |ИЗ
	        |	Документ.ЗаказКлиента КАК ЗаказКлиента
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗаказКлиента.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДокументДозвон.Ссылка КАК Ссылка,
	        |	ДокументДозвон.ПометкаУдаления КАК ПометкаУдаления,
	        |	ДокументДозвон.Номер КАК Номер,
	        |	ДокументДозвон.Дата КАК Дата,
	        |	ДокументДозвон.Проведен КАК Проведен,
	        |	ДокументДозвон.Исполнитель КАК Исполнитель,
	        |	ДокументДозвон.Автор КАК Автор,
	        |	ДокументДозвон.Статус КАК Статус,
	        |	ДокументДозвон.Клиент КАК Клиент,
	        |	ДокументДозвон.Телефон КАК Телефон,
	        |	ДокументДозвон.Комментарий КАК Комментарий,
	        |	НАЧАЛОПЕРИОДА(ДокументДозвон.ДатаВыполнения, ДЕНЬ) КАК ДатаВыполнения,
	        |	ДокументДозвон.МоментВремени КАК МоментВремени,
	        |	ВТ_Заявки.Ссылка КАК Ссылка1,
	        |	ВТ_КолвоПродаж.РегистраторСсылка КАК РегистраторСсылка,
	        |	ВТ_СуммаЗаявок.СуммаДокумента КАК СуммаДокумента,
	        |	ВТ_СуммаПродаж.Сумма КАК Сумма,
	        |	ВЫРАЗИТЬ(ДокументДозвон.КомментарийАудитора КАК СТРОКА(150)) КАК КомментарийАудитора,
	        |	КОЛИЧЕСТВО(ДокументДозвон.Ссылка) КАК КоличествоЗаписей,
	        |	ВЫБОР
	        |		КОГДА ДокументДозвон.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДозвона.Ожидание)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК КоличествоОжидание,
	        |	ВЫБОР
	        |		КОГДА ДокументДозвон.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДозвона.Выполнено)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК КоличествоВыполнено,
	        |	ДокументДозвон.Клиент.Город2 КАК КлиентГород2,
	        |	ДокументДозвон.ДатаПерезвона КАК ДатаПерезвона
	        |ИЗ
	        |	Документ.Дозвон КАК ДокументДозвон
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КолвоПродаж КАК ВТ_КолвоПродаж
	        |		ПО ДокументДозвон.Клиент = ВТ_КолвоПродаж.РегистраторКлиент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаПродаж КАК ВТ_СуммаПродаж
	        |		ПО ДокументДозвон.Клиент = ВТ_СуммаПродаж.РегистраторКлиент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	        |		ПО ДокументДозвон.Клиент = ВТ_Заявки.Клиент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаЗаявок КАК ВТ_СуммаЗаявок
	        |		ПО ДокументДозвон.Клиент = ВТ_СуммаЗаявок.Клиент
	        |ГДЕ
	        |	&Условие
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДокументДозвон.Ссылка,
	        |	ДокументДозвон.ПометкаУдаления,
	        |	ДокументДозвон.Номер,
	        |	ДокументДозвон.Дата,
	        |	ДокументДозвон.Проведен,
	        |	ДокументДозвон.Исполнитель,
	        |	ДокументДозвон.Автор,
	        |	ДокументДозвон.Статус,
	        |	ДокументДозвон.Клиент,
	        |	ДокументДозвон.Телефон,
	        |	ДокументДозвон.Комментарий,
	        |	ДокументДозвон.МоментВремени,
	        |	ВТ_Заявки.Ссылка,
	        |	ВТ_КолвоПродаж.РегистраторСсылка,
	        |	ВТ_СуммаЗаявок.СуммаДокумента,
	        |	ВТ_СуммаПродаж.Сумма,
	        |	НАЧАЛОПЕРИОДА(ДокументДозвон.ДатаВыполнения, ДЕНЬ),
	        |	ВЫРАЗИТЬ(ДокументДозвон.КомментарийАудитора КАК СТРОКА(150)),
	        |	ДокументДозвон.Клиент.Город2,
	        |	ДокументДозвон.ДатаПерезвона";
	
	Если Сортировка = "Все" Тогда
		Текст = СтрЗаменить(Текст, "ГДЕ", "");
		Текст = СтрЗаменить(Текст, "&Условие", "");
		Список.ТекстЗапроса = Текст;
	ИначеЕсли Сортировка = "Ожидание" Тогда
		Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.Статус = Значение(Перечисление.СтатусыДозвона.Ожидание)");
		Список.ТекстЗапроса = Текст;
	ИначеЕсли Сортировка = "Выполнено" Тогда
		Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.Статус = Значение(Перечисление.СтатусыДозвона.Выполнено)");
		Список.ТекстЗапроса = Текст;
		ИначеЕсли Сортировка = "Перезвон" Тогда
		Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.Статус = Значение(Перечисление.СтатусыДозвона.Перезвон)");
		Список.ТекстЗапроса = Текст;
	КонецЕсли;
	///-ГомзМА 31.01.2023 (Задача 000002631 от 31.01.2023)
	
	Элементы.Список.Обновить();
	
	///+ГомзМА 31.01.2023 (Задача 000002639 от 01.02.2023)
	ПолучитьКоличествоВСоответствииСоСтатусом();
	///-ГомзМА 31.01.2023 (Задача 000002639 от 01.02.2023)
	
КонецПроцедуры

Процедура ПолучитьКоличествоВСоответствииСоСтатусом()
	
	///+ГомзМА 31.01.2023 (Задача 000002639 от 01.02.2023)
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ВсегоКоличество = Результат.Количество(); 
    Количество = ВсегоКоличество;
	

	КоличествоВыполнено = 0;
	КоличествоОжидание = 0;
	Для каждого Строка из Результат Цикл
		Если Строка.Статус = Перечисления.СтатусыДозвона.Ожидание Тогда
				КоличествоОжидание = КоличествоОжидание + Строка.КоличествоОжидание;
				ПроцентОжидание = Окр(100 * КоличествоОжидание / Количество);
		ИначеЕсли Строка.Статус = Перечисления.СтатусыДозвона.Выполнено Тогда
				КоличествоВыполнено = КоличествоВыполнено + Строка.КоличествоВыполнено;
				ПроцентВыполнено = Окр(100 * КоличествоВыполнено / ВсегоКоличество);
		КонецЕсли;
	КонецЦикла;
	
	Количество = ВсегоКоличество;
	Если Сортировка = "Ожидание" Тогда
		Количество = КоличествоОжидание;
		Процент = ПроцентОжидание;
	ИначеЕсли Сортировка = "Выполнено" Тогда
		Количество = КоличествоВыполнено;
		Процент = ПроцентВыполнено;
	КонецЕсли;
	
	Если Сортировка = "Все" Тогда
		Соотношение = СтрШаблон("Выполнено: %1%% / Ожидание: %2%%", ПроцентВыполнено, ПроцентОжидание);
		Элементы.Соотношение.Видимость = Истина;
	Иначе
		Элементы.Соотношение.Видимость = Ложь;
	КонецЕсли;
	///-ГомзМА 31.01.2023 (Задача 000002639 от 01.02.2023)

КонецПроцедуры


&НаКлиенте
Процедура СортировкаПриИзменении(Элемент)
	
	СортировкаПриИзмененииНаСервере();
		
	Если Сортировка = "Все" Тогда
		Элементы.Процент.Видимость = Ложь;
	Иначе
		Элементы.Процент.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РассчитатьИтоги();
	
КонецПроцедуры

Процедура РассчитатьИтоги()
	
	///+ГомзМА 31.01.2023 (Задача 000002639 от 01.02.2023)
	Элементы.Процент.Видимость = Ложь;

    Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ВсегоКоличество = Результат.Количество(); 
    Количество = ВсегоКоличество;
	///-ГомзМА 31.01.2023 (Задача 000002639 от 01.02.2023)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Сортировка = "Все";
	
	ПолучитьКоличествоВСоответствииСоСтатусом();
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ПолучитьКоличествоВСоответствииСоСтатусом();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПерезвоновПриИзменении(Элемент)

 ПериодПерезвоновПриИзмененииНаСервере();


Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере 
Процедура ПериодПерезвоновПриИзмененииНаСервере()

		///+Сергеев 19.04.2023 
	Текст = "ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Продажи.Ссылка) КАК РегистраторСсылка,
	        |	Продажи.Клиент КАК РегистраторКлиент
	        |ПОМЕСТИТЬ ВТ_КолвоПродаж
	        |ИЗ
	        |	Документ.ПродажаЗапчастей КАК Продажи
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Продажи.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Продажи.Клиент КАК РегистраторКлиент,
	        |	СУММА(Продажи.ИтогоРекв) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_СуммаПродаж
	        |ИЗ
	        |	Документ.ПродажаЗапчастей КАК Продажи
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Продажи.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК Ссылка,
	        |	ЗаказКлиента.Клиент КАК Клиент
	        |ПОМЕСТИТЬ ВТ_Заявки
	        |ИЗ
	        |	Документ.ЗаказКлиента КАК ЗаказКлиента
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗаказКлиента.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗаказКлиента.Клиент КАК Клиент,
	        |	СУММА(ЗаказКлиента.СуммаДокумента) КАК СуммаДокумента
	        |ПОМЕСТИТЬ ВТ_СуммаЗаявок
	        |ИЗ
	        |	Документ.ЗаказКлиента КАК ЗаказКлиента
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗаказКлиента.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДокументДозвон.Ссылка КАК Ссылка,
	        |	ДокументДозвон.ПометкаУдаления КАК ПометкаУдаления,
	        |	ДокументДозвон.Номер КАК Номер,
	        |	ДокументДозвон.Дата КАК Дата,
	        |	ДокументДозвон.Проведен КАК Проведен,
	        |	ДокументДозвон.Исполнитель КАК Исполнитель,
	        |	ДокументДозвон.Автор КАК Автор,
	        |	ДокументДозвон.Статус КАК Статус,
	        |	ДокументДозвон.Клиент КАК Клиент,
	        |	ДокументДозвон.Телефон КАК Телефон,
	        |	ДокументДозвон.Комментарий КАК Комментарий,
	        |	НАЧАЛОПЕРИОДА(ДокументДозвон.ДатаВыполнения, ДЕНЬ) КАК ДатаВыполнения,
	        |	ДокументДозвон.МоментВремени КАК МоментВремени,
	        |	ВТ_Заявки.Ссылка КАК Ссылка1,
	        |	ВТ_КолвоПродаж.РегистраторСсылка КАК РегистраторСсылка,
	        |	ВТ_СуммаЗаявок.СуммаДокумента КАК СуммаДокумента,
	        |	ВТ_СуммаПродаж.Сумма КАК Сумма,
	        |	ВЫРАЗИТЬ(ДокументДозвон.КомментарийАудитора КАК СТРОКА(150)) КАК КомментарийАудитора,
	        |	КОЛИЧЕСТВО(ДокументДозвон.Ссылка) КАК КоличествоЗаписей,
	        |	ВЫБОР
	        |		КОГДА ДокументДозвон.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДозвона.Ожидание)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК КоличествоОжидание,
	        |	ВЫБОР
	        |		КОГДА ДокументДозвон.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДозвона.Выполнено)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК КоличествоВыполнено,
	        |	ДокументДозвон.Клиент.Город2 КАК КлиентГород2,
	        |	ДокументДозвон.ДатаПерезвона КАК ДатаПерезвона
	        |ИЗ
	        |	Документ.Дозвон КАК ДокументДозвон
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КолвоПродаж КАК ВТ_КолвоПродаж
	        |		ПО ДокументДозвон.Клиент = ВТ_КолвоПродаж.РегистраторКлиент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаПродаж КАК ВТ_СуммаПродаж
	        |		ПО ДокументДозвон.Клиент = ВТ_СуммаПродаж.РегистраторКлиент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	        |		ПО ДокументДозвон.Клиент = ВТ_Заявки.Клиент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаЗаявок КАК ВТ_СуммаЗаявок
	        |		ПО ДокументДозвон.Клиент = ВТ_СуммаЗаявок.Клиент
	        |ГДЕ
	        |	&Условие
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДокументДозвон.Ссылка,
	        |	ДокументДозвон.ПометкаУдаления,
	        |	ДокументДозвон.Номер,
	        |	ДокументДозвон.Дата,
	        |	ДокументДозвон.Проведен,
	        |	ДокументДозвон.Исполнитель,
	        |	ДокументДозвон.Автор,
	        |	ДокументДозвон.Статус,
	        |	ДокументДозвон.Клиент,
	        |	ДокументДозвон.Телефон,
	        |	ДокументДозвон.Комментарий,
	        |	ДокументДозвон.МоментВремени,
	        |	ВТ_Заявки.Ссылка,
	        |	ВТ_КолвоПродаж.РегистраторСсылка,
	        |	ВТ_СуммаЗаявок.СуммаДокумента,
	        |	ВТ_СуммаПродаж.Сумма,
	        |	НАЧАЛОПЕРИОДА(ДокументДозвон.ДатаВыполнения, ДЕНЬ),
	        |	ВЫРАЗИТЬ(ДокументДозвон.КомментарийАудитора КАК СТРОКА(150)),
	        |	ДокументДозвон.Клиент.Город2,
	        |	ДокументДозвон.ДатаПерезвона";
	Если ЗначениеЗаполнено(ПериодПерезвонов) Тогда
		Если Сортировка = "Все" Тогда
			//Текст = СтрЗаменить(Текст, "ГДЕ", "");
			Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.ДатаПерезвона Между " + "&ДатаНачала"+ " И " + "&ДатаОкончания");
			Список.ТекстЗапроса = Текст;
		ИначеЕсли Сортировка = "Ожидание" Тогда
			Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.Статус = Значение(Перечисление.СтатусыДозвона.Ожидание) и ДокументДозвон.ДатаПерезвона Между " + "&ДатаНачала"+ " И " + "&ДатаОкончания");
			Список.ТекстЗапроса = Текст;
		ИначеЕсли Сортировка = "Выполнено" Тогда
			Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.Статус = Значение(Перечисление.СтатусыДозвона.Выполнено) и ДокументДозвон.ДатаПерезвона Между " + "&ДатаНачала"+ " И " + "&ДатаОкончания");
			Список.ТекстЗапроса = Текст;
		ИначеЕсли Сортировка = "Перезвон" Тогда
			Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.Статус = Значение(Перечисление.СтатусыДозвона.Перезвон) и ДокументДозвон.ДатаПерезвона Между " + "&ДатаНачала"+ " И " + "&ДатаОкончания");
			Список.ТекстЗапроса = Текст;
			
		КонецЕсли;
		Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодПерезвонов.ДатаНачала);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодПерезвонов.ДатаОкончания);
	Иначе
		Текст = СтрЗаменить(Текст, "ГДЕ", "");
		Текст = СтрЗаменить(Текст, "&Условие", "");
		Список.ТекстЗапроса = Текст;

	КонецЕсли;
	///-Сергеев 19.04.2023 
	
	
КонецПроцедуры
